

# Chapter 13: Advanced Data Analysis using pandas

In this notebook, we will cover advanced topics for data analysis using pandas, including:
1. Joining DataFrames
2. Concatenation of Tables
3. Aggregation Functions on DataFrames
4. SQL Equivalent Statements in pandas
5. Using Regular Expressions


### 1. Joining DataFrames
Joining DataFrames in pandas allows you to combine data from different sources based on common keys. There are several types of joins available:

In [5]:

#### Example DataFrames
import pandas as pd

# DataFrame 1
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
})

# DataFrame 2
df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Name': ['Charlie', 'David', 'Eve', 'Frank'],
    'Salary': [70000, 80000, 90000, 100000]
})

In [6]:

# Inner Join
inner_join = pd.merge(df1, df2, on='ID', how='inner')
print("Inner Join:")
print(inner_join)

Inner Join:
   ID   Name_x  Age   Name_y  Salary
0   3  Charlie   35  Charlie   70000
1   4    David   40    David   80000

In [7]:

# Outer Join
outer_join = pd.merge(df1, df2, on='ID', how='outer')
print("Outer Join:")
print(outer_join)

Outer Join:
   ID   Name_x   Age   Name_y    Salary
0   1    Alice  25.0      NaN       NaN
1   2      Bob  30.0      NaN       NaN
2   3  Charlie  35.0  Charlie   70000.0
3   4    David  40.0    David   80000.0
4   5      NaN   NaN      Eve   90000.0
5   6      NaN   NaN    Frank  100000.0

In [4]:

# Left Join
left_join = pd.merge(df1, df2, on='ID', how='left')
print("Left Join:")
print(left_join)

Left Join:
   ID   Name_x  Age   Name_y   Salary
0   1    Alice   25      NaN      NaN
1   2      Bob   30      NaN      NaN
2   3  Charlie   35  Charlie  70000.0
3   4    David   40    David  80000.0

In [8]:

# Right Join
right_join = pd.merge(df1, df2, on='ID', how='right')
print("Right Join:")
print(right_join)

Right Join:
   ID   Name_x   Age   Name_y  Salary
0   3  Charlie  35.0  Charlie   70000
1   4    David  40.0    David   80000
2   5      NaN   NaN      Eve   90000
3   6      NaN   NaN    Frank  100000

In [16]:
# Concatenate along rows
concatenated_rows = pd.concat([df1, df2], axis=0, ignore_index=True)
print("Concatenated along rows:")
print(concatenated_rows)

Concatenated along rows:
   ID     Name   Age    Salary
0   1    Alice  25.0       NaN
1   2      Bob  30.0       NaN
2   3  Charlie  35.0       NaN
3   4    David  40.0       NaN
4   3  Charlie   NaN   70000.0
5   4    David   NaN   80000.0
6   5      Eve   NaN   90000.0
7   6    Frank   NaN  100000.0

In [10]:
# Concatenate along columns
concatenated_columns = pd.concat([df1, df2], axis=1)
print("Concatenated along columns:")
print(concatenated_columns)

Concatenated along columns:
   ID     Name  Age  ID     Name  Salary
0   1    Alice   25   3  Charlie   70000
1   2      Bob   30   4    David   80000
2   3  Charlie   35   5      Eve   90000
3   4    David   40   6    Frank  100000

In [11]:
# Group by 'ID' and aggregate by 'Age'
agg_df = df1.groupby('ID').agg({
    'Age': ['min', 'max', 'mean'],
})
print("Aggregation Functions:")
print(agg_df)

Aggregation Functions:
   Age
   min max  mean
ID
1   25  25  25.0
2   30  30  30.0
3   35  35  35.0
4   40  40  40.0

In [12]:
# SQL equivalent of SELECT * FROM df1 WHERE Age > 30
sql_like_query = df1[df1['Age'] > 30]
print("SQL-like Query:")
print(sql_like_query)
print("")
print(" ")

SQL-like Query:
   ID     Name  Age
2   3  Charlie   35
3   4    David   40

In [13]:
# SQL equivalent of SELECT AVG(Age) FROM df1 GROUP BY ID
sql_like_groupby = df1.groupby('ID').agg({'Age': 'mean'})
print("SQL-like GroupBy:")
print(sql_like_groupby)

SQL-like GroupBy:
     Age
ID
1   25.0
2   30.0
3   35.0
4   40.0

In [14]:
# Using regex to filter rows with 'Name' starting with 'A'
regex_filter = df1[df1['Name'].str.match(r'^A', na=False)]
print("Rows where Name starts with 'A':")
print(regex_filter)

Rows where Name starts with 'A':
   ID   Name  Age
0   1  Alice   25


# Methods and groupby() in pandas

In this notebook, we will explore:
1. The `method()` functionality in pandas for handling DataFrame operations.
2. The `groupby()` method for aggregating data.

### 1. `method()` in pandas
Methods in pandas are used to manipulate or analyze DataFrame and Series objects. Some commonly used methods include `head()`, `tail()`, `describe()`, `info()`, and more.

In [24]:

#### Example
import pandas as pd

# Creating a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve','Frank'],
    'Age': [25, 30, 35, 40, 45, 50],
    'Salary': [50000, 60000, 70000, 80000, 90000, 100000]
}
df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000
5    Frank   50  100000

In [26]:
# Display the first few rows using head()
print("Head of the DataFrame:")
print(df.head())

Head of the DataFrame:
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000

In [27]:
# Display the last few rows using tail()
print("Tail of the DataFrame:")
print(df.tail())

Tail of the DataFrame:
      Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000
5    Frank   50  100000

In [29]:
# Descriptive statistics
print("Descriptive Statistics:")
print(df.describe())

Descriptive Statistics:
             Age         Salary
count   6.000000       6.000000
mean   37.500000   75000.000000
std     9.354143   18708.286934
min    25.000000   50000.000000
25%    31.250000   62500.000000
50%    37.500000   75000.000000
75%    43.750000   87500.000000
max    50.000000  100000.000000

In [30]:
# Information about the DataFrame
print("DataFrame Info:")
print(df.info())

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes
None

In [31]:
# Creating a sample DataFrame
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 55000, 70000, 80000]
}
df = pd.DataFrame(data)

# Group by 'Department' and calculate the sum of salaries
grouped = df.groupby('Department')['Salary'].sum()
print("Grouped by Department (Sum of Salaries):")
print(grouped)

# Group by 'Department' and calculate multiple aggregates
grouped_agg = df.groupby('Department').agg({
    'Salary': ['mean', 'max', 'min']
})
print("Grouped by Department (Aggregated Metrics):")
print(grouped_agg)

Grouped by Department (Sum of Salaries):
Department
Finance     80000
HR         105000
IT         130000
Name: Salary, dtype: int64
Grouped by Department (Aggregated Metrics):
             Salary
               mean    max    min
Department
Finance     80000.0  80000  80000
HR          52500.0  55000  50000
IT          65000.0  70000  60000